btcven/cortex-debug-cc26xx-cc13xx/data/cc1310f32.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AON_SYSCTL</name>
      <baseAddress>0x40090000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <description>This component controls AON_SYSCTL, which is the device's system controller.

Note: This module is only supporting 32 bit ReadWrite access from MCU</description>
      <registers>
        <register>
          <name>PWRCTL</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Power Management

This register controls bitfields for setting low level power management features such as selection of  regulator for VDDR supply and control of IO ring where certain segments can be enabled / disabled.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>DCDC_ACTIVE</name>
              <description>[2:2] Select to use DCDC regulator for VDDR in active mode 

0: Use GLDO for regulation of VDDRin active mode. 
1: Use DCDC for regulation of VDDRin active mode.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>EXT_REG_MODE</name>
              <description>[1:1] Status of source for VDDRsupply:

0: DCDC/GLDO are generating VDDR
1: DCDC/GLDO are bypassed, external regulator supplies VDDR</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DCDC_EN</name>
              <description>[0:0] Select to use DCDC regulator during recharge of VDDR

0: Use GLDO for recharge of VDDR
1: Use DCDC for recharge of VDDR

Note: This bitfield should be set to the same as DCDC_ACTIVE</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RESETCTL</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Reset Management

This register contains bitfields releated to system reset such as reset source and reset request  and control of brown out resets.</description>
          <fields>
            <field>
              <name>SYSRESET</name>
              <description>[31:31] Cold reset register. Writing 1 to this bitfield will reset the entire chip and cause boot code to run again.

0: No effect
1: Generate system reset. Appears as SYSRESET in RESET_SRC.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>RESERVED26</name>
              <description>[30:26] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>BOOT_DET_1_CLR</name>
              <description>[25:25] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>BOOT_DET_0_CLR</name>
              <description>[24:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RESERVED18</name>
              <description>[23:18] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>BOOT_DET_1_SET</name>
              <description>[17:17] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>BOOT_DET_0_SET</name>
              <description>[16:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>WU_FROM_SD</name>
              <description>[15:15] A Wakeup from SHUTDOWN on an IO event has occurred, or a wakeup from SHUTDOWN has occurred as a result of the debugger being attached.. (TCK pin being forced low) 

Please refer to [IOC:IOCFGn,.WU_CFG] for configuring the IO's as wakeup sources.

0: Wakeup occurred from cold reset or brown out as seen in RESET_SRC
1: A wakeup has occurred from SHUTDOWN

Note: This flag can not be cleared and will therefor remain valid untill poweroff/reset</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>GPIO_WU_FROM_SD</name>
              <description>[14:14] A wakeup from SHUTDOWN on an IO event has occurred 

Please refer to [IOC:IOCFGn,.WU_CFG] for configuring the IO's as wakeup sources.

0: The wakeup did not occur from SHUTDOWN on an IO event
1: A wakeup from SHUTDOWN occurred from an IO event

The case where WU_FROM_SD is asserted but this bitfield is not asserted will only occur in a debug session. The boot code will not proceed with wakeup from SHUTDOWN procedure until this bitfield is asserted as well.

Note: This flag can not be cleared and will therefor remain valid untill poweroff/reset</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>BOOT_DET_1</name>
              <description>[13:13] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>BOOT_DET_0</name>
              <description>[12:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>VDDS_LOSS_EN_OVR</name>
              <description>[11:11] Override of VDDS_LOSS_EN

0: Brown out detect of VDDS is ignored, unless VDDS_LOSS_EN=1
1: Brown out detect of VDDS generates system reset (regardless of  VDDS_LOSS_EN)

