btcven/cortex-debug-cc26xx-cc13xx/data/cc1310f32.svd
Strength and trim control for current source. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>TRIM</name>
              <description>[7:2] Adjust current from current source.

Output currents may be combined to get desired total current.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>11P75U</name>
                  <value>32</value>
                  <description>11.75 uA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4P5U</name>
                  <value>16</value>
                  <description>4.5 uA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2P0U</name>
                  <value>8</value>
                  <description>2.0 uA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P0U</name>
                  <value>4</value>
                  <description>1.0 uA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0P5U</name>
                  <value>2</value>
                  <description>0.5 uA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0P25U</name>
                  <value>1</value>
                  <description>0.25 uA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NC</name>
                  <value>0</value>
                  <description>No current connected</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[1:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] Current source enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>COMP</name>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <description>Comparator

Control COMPA and COMPB comparators. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>COMPA_REF_RES_EN</name>
              <description>[7:7] Enables 400kohm resistance from COMPA reference node to ground. Used with COMPA_REF_CURR_EN to generate voltage reference for cap-sense.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>COMPA_REF_CURR_EN</name>
              <description>[6:6] Enables 2uA IPTAT current from ISRC to COMPA reference node. Requires ISRC.EN = 1. Used with COMPA_REF_RES_EN to generate voltage reference for cap-sense.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>COMPB_TRIM</name>
              <description>[5:3] COMPB voltage reference trim temperature coded:</description>
              <bitWidth>3</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV4</name>
                  <value>7</value>
                  <description>Divide reference by 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV3</name>
                  <value>3</value>
                  <description>Divide reference by 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <value>1</value>
                  <description>Divide reference by 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV1</name>
                  <value>0</value>
                  <description>No reference division</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPB_EN</name>
              <description>[2:2] COMPB enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[1:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>COMPA_EN</name>
              <description>[0:0] COMPA enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MUX4</name>
          <addressOffset>0x7</addressOffset>
          <size>8</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>COMPA_REF</name>
              <description>[7:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUXIO0</name>
                  <value>128</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO1</name>
                  <value>64</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO2</name>
                  <value>32</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO3</name>
                  <value>16</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO4</name>
                  <value>8</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO5</name>
                  <value>4</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO6</name>
                  <value>2</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO7</name>
                  <value>1</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NC</name>
                  <value>0</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADC0</name>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <description>ADC Control 0

ADC Sample Control. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>SMPL_MODE</name>
              <description>[7:7] ADC Sampling mode:

