btcven/cortex-debug-cc26xx-cc13xx/data/cc1310f32.svd
When GPIODOUT bit 0 is 0: AUXIO[8i+0] is driven low.  

When GPIODOUT bit 0 is 1: AUXIO[8i+0] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <value>1</value>
                  <description>Input Mode:

When GPIODIE bit 0 is 0: AUXIO[8i+0] is enabled for analog signal transfer.

When GPIODIE bit 0 is 1: AUXIO[8i+0] is enabled for digital input.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT</name>
                  <value>0</value>
                  <description>Output Mode:

GPIODOUT bit 0 drives AUXIO[8i+0].</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>GPIODIN</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>General Purpose Input Output Data In

This register provides synchronized input data for AUXIO  that are controlled by instance i of AUX_AIODIO. Hence, in formulas below i = 0 for AUX_AIODIO0 and I = 1 for AUX_AIODIO1.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>IO7_0</name>
              <description>[7:0] Bit n in this bit vector contains the value for AUXIO[8i+n] when GPIODIE bit n is set. Otherwise, bit n value is old.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>GPIODOUTSET</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>General Purpose Input Output Data Out Set

Set bits in GPIODOUT in instance i of AUX_AIODIO. Hence, in formulas below i = 0 for AUX_AIODIO0 and  i = 1 for AUX_AIODIO1.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>IO7_0</name>
              <description>[7:0] Write 1 to bit index n in this bit vector to set GPIODOUT bit n. 

Read value is 0.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>GPIODOUTCLR</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>General Purpose Input Output Data Out Clear

Clear bits in GPIODOUT instance i of AUX_AIODIO. Hence, in formulas below i = 0 for AUX_AIODIO0 and i = 1 for AUX_AIODIO1.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>IO7_0</name>
              <description>[7:0] Write 1 to bit index n in this bit vector to clear GPIODOUT bit n.

Read value is 0.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>GPIODOUTTGL</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>General Purpose Input Output Data Out Toggle

Toggle bits in GPIODOUT in instance i of AUX_AIODIO. Hence, in formulas below i = 0 for AUX_AIODIO0 and i = 1 for AUX_AIODIO1.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>IO7_0</name>
              <description>[7:0] Write 1 to bit index n in this bit vector to toggle GPIODOUT bit n. 

Read value is 0.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>GPIODIE</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>General Purpose Input Output Digital Input Enable

This register controls input buffers for AUXIO that are controlled by instance i of AUX_AIODIO.  Hence, in formulas below i = 0 for AUX_AIODIO0 and I = 1 for AUX_AIODIO1.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>IO7_0</name>
              <description>[7:0] Write 1 to bit index n in this bit vector to enable digital input buffer for AUXIO[8i+n]. 
Write 0 to bit index n in this bit vector to disable digital input buffer for AUXIO[8i+n].

