btcven/cortex-debug-cc26xx-cc13xx/data/cc1310f32.svd
System CPU must wait two clock cycles before it sets CMD to EN or DIS.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Enable ADC interface.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Disable ADC interface.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADCFIFOSTAT</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>ADC FIFO Status

FIFO can hold up to four ADC samples.</description>
          <fields>
            <field>
              <name>RESERVED5</name>
              <description>[31:5] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>OVERFLOW</name>
              <description>[4:4] FIFO overflow flag.

0: FIFO has not overflowed.
1: FIFO has overflowed, this flag is sticky until you flush the FIFO.

When the flag is set, the ADC FIFO write pointer is static. It is not possible to add more samples to the ADC FIFO. Flush FIFO to clear the flag.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>UNDERFLOW</name>
              <description>[3:3] FIFO underflow flag.

0: FIFO has not underflowed.
1: FIFO has underflowed, this flag is sticky until you flush the FIFO.

When the flag is set, the ADC FIFO read pointer is static. Read returns the previous sample that was read. Flush FIFO to clear the flag.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>FULL</name>
              <description>[2:2] FIFO full flag.

0: FIFO is not full, there is less than 4 samples in the FIFO. 
1: FIFO is full, there are 4 samples in the FIFO.

When the flag is set, it is not possible to add more samples to the ADC FIFO. An attempt to add samples sets the OVERFLOW flag.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>ALMOST_FULL</name>
              <description>[1:1] FIFO almost full flag.

0: There are less than 3 samples in the FIFO, or the FIFO is full. The FULL flag is also asserted in the latter case.
1: There are 3 samples in the FIFO, there is room for one more sample.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>EMPTY</name>
              <description>[0:0] FIFO empty flag.

0: FIFO contains one or more samples.
1: FIFO is empty.

When the flag is set, read returns the previous sample that was read and sets the UNDERFLOW flag.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>ADCFIFO</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>ADC FIFO</description>
          <fields>
            <field>
              <name>RESERVED12</name>
              <description>[31:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>DATA</name>
              <description>[11:0] FIFO data.

Read:
Get oldest ADC sample from FIFO.

Write:
Write dummy sample to FIFO. This is useful for code development when you do not have real ADC samples.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADCTRIG</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>ADC Trigger</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>START</name>
              <description>[0:0] Manual ADC trigger. 

0: No effect.
1: Single ADC trigger. 

To manually trigger the ADC, you must set ADCCTL.START_SRC to NO_EVENT&lt;n> to avoid conflict with event-driven ADC trigger.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ISRCCTL</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Current Source Control</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RESET_N</name>
              <description>[0:0] ISRC reset control.

0: ISRC drives 0 uA.
1: ISRC drives current ADI_4_AUX:ISRC.TRIM to COMPA_IN.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
