btcven/cortex-debug-cc26xx-cc13xx/data/cc1310f32.svd
This register contains a collection of event flags routed to AON_EVENT. 

To clear an event flag, write to EVTOAONFLAGSCLR or write 0 to event flag in this register.</description>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>TIMER1_EV</name>
              <description>[8:8] This event flag is set when level selected by EVTOAONPOL.TIMER1_EV occurs on EVSTAT0.TIMER1_EV.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TIMER0_EV</name>
              <description>[7:7] This event flag is set when level selected by EVTOAONPOL.TIMER0_EV occurs on EVSTAT0.TIMER0_EV.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>TDC_DONE</name>
              <description>[6:6] This event flag is set when level selected by EVTOAONPOL.TDC_DONE occurs on EVSTAT0.TDC_DONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>ADC_DONE</name>
              <description>[5:5] This event flag is set when level selected by EVTOAONPOL.ADC_DONE occurs on EVSTAT0.ADC_DONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>AUX_COMPB</name>
              <description>[4:4] This event flag is set when edge selected by EVTOAONPOL.AUX_COMPB occurs on EVSTAT0.AUX_COMPB.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>[3:3] This event flag is set when edge selected by EVTOAONPOL.AUX_COMPA occurs on EVSTAT0.AUX_COMPA.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SWEV2</name>
              <description>[2:2] This event flag is set when software writes a 1 to SWEVSET.SWEV2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SWEV1</name>
              <description>[1:1] This event flag is set when software writes a 1 to SWEVSET.SWEV1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SWEV0</name>
              <description>[0:0] This event flag is set when software writes a 1 to SWEVSET.SWEV0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVTOAONPOL</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Events To AON Polarity

Event source polarity configuration for EVTOAONFLAGS.</description>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>TIMER1_EV</name>
              <description>[8:8] Select the level of EVSTAT0.TIMER1_EV that sets EVTOAONFLAGS.TIMER1_EV.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER0_EV</name>
              <description>[7:7] Select the level of EVSTAT0.TIMER0_EV that sets EVTOAONFLAGS.TIMER0_EV.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDC_DONE</name>
              <description>[6:6] Select level of EVSTAT0.TDC_DONE that sets EVTOAONFLAGS.TDC_DONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DONE</name>
              <description>[5:5] Select the level of  EVSTAT0.ADC_DONE that sets EVTOAONFLAGS.ADC_DONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_COMPB</name>
              <description>[4:4] Select the edge of  EVSTAT0.AUX_COMPB that sets EVTOAONFLAGS.AUX_COMPB.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Falling edge</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>Rising edge</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>[3:3] Select the edge of  EVSTAT0.AUX_COMPA that sets EVTOAONFLAGS.AUX_COMPA.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Falling edge</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>Rising edge</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[2:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DMACTL</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Direct Memory Access Control</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>REQ_MODE</name>
              <description>[2:2] UDMA0 Request mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <value>1</value>
                  <description>Single requests are generated on UDMA0 channel 7 when the condition configured in SEL is met.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BURST</name>
                  <value>0</value>
                  <description>Burst requests are generated on UDMA0 channel 7 when the condition configured in SEL is met.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN</name>
              <description>[1:1] uDMA ADC interface enable.

0: Disable UDMA0 interface to ADC.
1: Enable UDMA0 interface to ADC.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SEL</name>
              <description>[0:0] Select FIFO watermark level required to trigger a UDMA0 transfer of ADC FIFO data.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFO_ALMOST_FULL</name>
                  <value>1</value>
                  <description>UDMA0 trigger event will be generated when the ADC FIFO is almost full (3/4 full).</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_NOT_EMPTY</name>
                  <value>0</value>
                  <description>UDMA0 trigger event will be generated when there are samples in the ADC FIFO.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SWEVSET</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Software Event Set

