btcven/cortex-debug-cc26xx-cc13xx/data/cc1310f32.svd
Sticky Request for Single Semaphore.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SMPH_ID</name>
              <description>[2:0] Write the semaphore ID,0x0-0x7, to SMPH_ID to request this semaphore until it is granted. 

When semaphore SMPH_ID is granted, event  AUX_EVCTL:EVSTAT0.AUX_SMPH_AUTOTAKE_DONE becomes 1. 

The event becomes 0 when software releases the semaphore or writes a new value to SMPH_ID.

To avoid corrupted semaphores: 
- Usage of this functionality must be restricted to one CPU core. 
- Software must wait until AUX_EVCTL:EVSTAT0.AUX_SMPH_AUTOTAKE_DONE is 1 before it writes a new value to SMPH_ID.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_TDCIF</name>
      <baseAddress>0x400C4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>AUX Time To Digital Converter</description>
      <registers>
        <register>
          <name>CTL</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Control</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CMD</name>
              <description>[1:0] TDC commands.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABORT</name>
                  <value>3</value>
                  <description>Force TDC state machine back to IDLE state.

Never write this command while AUX_TDC:STAT.STATE equals CLR_CNT or WAIT_CLR_CNT_DONE.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN</name>
                  <value>2</value>
                  <description>Asynchronous counter start.

The counter starts to count when the start event is high. To achieve precise edge-to-edge measurements you must ensure that the start event is low for at least 420 ns after you write this command.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_SYNC_START</name>
                  <value>1</value>
                  <description>Synchronous counter start.

The counter looks for the opposite edge of the selected start event before it starts to count when the selected edge occurs. This guarantees an edge-triggered start and is recommended for frequency measurements.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_RESULT</name>
                  <value>0</value>
                  <description>Clear STAT.SAT, STAT.DONE, and RESULT.VALUE. 

This is not needed as prerequisite for a measurement. Reliable clear is only guaranteed from IDLE state.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STAT</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Status</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SAT</name>
              <description>[7:7] TDC measurement saturation flag.

0: Conversion has not saturated.
1: Conversion stopped due to saturation.

This field is cleared when a new measurement is started or when CLR_RESULT is written to CTL.CMD.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>DONE</name>
              <description>[6:6] TDC measurement complete flag.

0: TDC measurement has not yet completed.
1: TDC measurement has completed.

This field clears when a new TDC measurement starts or when you write CLR_RESULT to CTL.CMD.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>STATE</name>
              <description>[5:0] TDC state machine status.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_STOP</name>
                  <value>46</value>
                  <description>Current state is TDC_FORCESTOP.
You wrote ABORT to CTL.CMD to abort the TDC measurement.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START_FALL</name>
                  <value>30</value>
                  <description>Current state is TDC_WAIT_STARTFALL. 
The fast-counter circuit waits for a falling edge on the start event.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_CLR_CNT_DONE</name>
                  <value>22</value>
                  <description>Current state is TDC_STATE_WAIT_CLRCNT_DONE. 
The state machine waits for fast-counter circuit to finish reset.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR</name>
                  <value>15</value>
                  <description>Current state is TDC_STATE_POR. 
This is the reset state.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GET_RESULT</name>
                  <value>14</value>
                  <description>Current state is TDC_STATE_GETRESULTS.
The state machine copies the counter value from the fast-counter circuit.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_STOP_CNTDWN</name>
                  <value>12</value>
                  <description>Current state is TDC_STATE_WAIT_STOPCNTDOWN.
The fast-counter circuit looks for the stop condition. It will ignore a number of stop events configured in TRIGCNTLOAD.CNT.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_STOP</name>
                  <value>8</value>
                  <description>Current state is TDC_STATE_WAIT_STOP.
The state machine waits for the fast-counter circuit to stop.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_CNT</name>
                  <value>7</value>
                  <description>Current state is TDC_STATE_CLRCNT. The fast-counter circuit is reset.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE</name>
                  <value>6</value>
                  <description>Current state is TDC_STATE_IDLE. 
This is the default state after reset and abortion. State will change when you write CTL.CMD to either RUN_SYNC_START or RUN.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_START_STOP_CNT_EN</name>
                  <value>4</value>
                  <description>Current state is TDC_STATE_WAIT_STARTSTOPCNTEN.
The fast-counter circuit looks for the start condition. The state machine waits for the fast-counter to increment.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_START</name>
                  <value>0</value>
                  <description>Current state is TDC_STATE_WAIT_START. 
The fast-counter circuit looks for the start condition. The state machine waits for the fast-counter to increment.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x6</resetValue>
        </register>
        <register>
          <name>RESULT</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Result

Result of last TDC conversion</description>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>[31:25] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[24:0] TDC conversion result.

The result of the TDC conversion is given in number of clock edges of the clock source selected in DDI_0_OSC:CTL0.ACLK_TDC_SRC_SEL. Both rising and falling edges are counted.

If TDC counter saturates, VALUE is slightly higher than SATCFG.LIMIT, as it takes a non-zero time to stop the measurement. Hence, the maximum value of this field becomes slightly higher than 2^24 if you configure SATCFG.LIMIT to R24.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x2</resetValue>
        </register>
        <register>
          <name>SATCFG</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Saturation Configuration</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>LIMIT</name>
              <description>[3:0] Saturation limit.

The flag STAT.SAT is set when the TDC counter saturates.

Values not enumerated are not supported</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R24</name>
                  <value>15</value>
                  <description>Result bit 24: TDC conversion saturates and stops when RESULT.VALUE[24] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R23</name>
                  <value>14</value>
                  <description>Result bit 23: TDC conversion saturates and stops when RESULT.VALUE[23] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R22</name>
                  <value>13</value>
                  <description>Result bit 22: TDC conversion saturates and stops when RESULT.VALUE[22] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R21</name>
                  <value>12</value>
                  <description>Result bit 21: TDC conversion saturates and stops when RESULT.VALUE[21] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R20</name>
                  <value>11</value>
                  <description>Result bit 20: TDC conversion saturates and stops when RESULT.VALUE[20] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R19</name>
                  <value>10</value>
                  <description>Result bit 19: TDC conversion saturates and stops when RESULT.VALUE[19] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R18</name>
                  <value>9</value>
                  <description>Result bit 18: TDC conversion saturates and stops when RESULT.VALUE[18] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R17</name>
                  <value>8</value>
                  <description>Result bit 17: TDC conversion saturates and stops when RESULT.VALUE[17] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R16</name>
                  <value>7</value>
                  <description>Result bit 16: TDC conversion saturates and stops when RESULT.VALUE[16] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R15</name>
                  <value>6</value>
                  <description>Result bit 15: TDC conversion saturates and stops when RESULT.VALUE[15] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R14</name>
                  <value>5</value>
                  <description>Result bit 14: TDC conversion saturates and stops when RESULT.VALUE[14] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R13</name>
                  <value>4</value>
                  <description>Result bit 13: TDC conversion saturates and stops when RESULT.VALUE[13] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R12</name>
                  <value>3</value>
                  <description>Result bit 12: TDC conversion saturates and stops when RESULT.VALUE[12] is set.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0xF</resetValue>
        </register>
        <register>
          <name>TRIGSRC</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Trigger Source

