btcven/cortex-debug-cc26xx-cc13xx/data/cc1310f32.svd
        <register>
          <name>FSM_SAV_PPUL</name>
          <addressOffset>0x2230</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED12</name>
              <description>[31:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>SAV_P_PUL</name>
              <description>[11:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FSM_PE_VH</name>
          <addressOffset>0x2234</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>PGM_VH</name>
              <description>[15:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ERA_VH</name>
              <description>[7:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x100</resetValue>
        </register>
        <register>
          <name>FSM_PRG_PW</name>
          <addressOffset>0x2240</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>PROG_PUL_WIDTH</name>
              <description>[15:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FSM_ERA_PW</name>
          <addressOffset>0x2244</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>FSM_ERA_PW</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FSM_SAV_ERA_PUL</name>
          <addressOffset>0x2254</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED12</name>
              <description>[31:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>SAV_ERA_PUL</name>
              <description>[11:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FSM_TIMER</name>
          <addressOffset>0x2258</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>FSM_TIMER</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FSM_MODE</name>
          <addressOffset>0x225c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED20</name>
              <description>[31:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>RDV_SUBMODE</name>
              <description>[19:18] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>PGM_SUBMODE</name>
              <description>[17:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>ERA_SUBMODE</name>
              <description>[15:14] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>SUBMODE</name>
              <description>[13:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>SAV_PGM_CMD</name>
              <description>[11:9] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>SAV_ERA_MODE</name>
              <description>[8:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>MODE</name>
              <description>[5:3] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CMD</name>
              <description>[2:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FSM_PGM</name>
          <addressOffset>0x2260</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED26</name>
              <description>[31:26] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>PGM_BANK</name>
              <description>[25:23] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>PGM_ADDR</name>
              <description>[22:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FSM_ERA</name>
          <addressOffset>0x2264</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED26</name>
              <description>[31:26] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>ERA_BANK</name>
              <description>[25:23] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>ERA_ADDR</name>
              <description>[22:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FSM_PRG_PUL</name>
          <addressOffset>0x2268</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED20</name>
              <description>[31:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>BEG_EC_LEVEL</name>
              <description>[19:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>[15:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>MAX_PRG_PUL</name>
              <description>[11:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x40032</resetValue>
        </register>
        <register>
          <name>FSM_ERA_PUL</name>
          <addressOffset>0x226c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED20</name>
              <description>[31:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>MAX_EC_LEVEL</name>
              <description>[19:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>[15:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>MAX_ERA_PUL</name>
              <description>[11:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x40BB8</resetValue>
        </register>
        <register>
          <name>FSM_STEP_SIZE</name>
          <addressOffset>0x2270</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>[31:25] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>EC_STEP_SIZE</name>
              <description>[24:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>9</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[15:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FSM_PUL_CNTR</name>
          <addressOffset>0x2274</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>[31:25] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>CUR_EC_LEVEL</name>
              <description>[24:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>9</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>[15:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PUL_CNTR</name>
              <description>[11:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FSM_EC_STEP_HEIGHT</name>
          <addressOffset>0x2278</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>EC_STEP_HEIGHT</name>
              <description>[3:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FSM_ST_MACHINE</name>
          <addressOffset>0x227c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>DO_PRECOND</name>
              <description>[23:23] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>FSM_INT_EN</name>
              <description>[22:22] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>ALL_BANKS</name>
              <description>[21:21] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>CMPV_ALLOWED</name>
              <description>[20:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>RANDOM</name>
              <description>[19:19] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>RV_SEC_EN</name>
              <description>[18:18] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>RV_RES</name>
              <description>[17:17] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>RV_INT_EN</name>
              <description>[16:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED15</name>
              <description>[15:15] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>ONE_TIME_GOOD</name>
              <description>[14:14] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>[13:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>DO_REDU_COL</name>
              <description>[11:11] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>DBG_SHORT_ROW</name>
              <description>[10:7] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>[6:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PGM_SEC_COF_EN</name>
              <description>[5:5] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PREC_STOP_EN</name>
              <description>[4:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DIS_TST_EN</name>
              <description>[3:3] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CMD_EN</name>
              <description>[2:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>INV_DATA</name>
              <description>[1:1] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>OVERRIDE</name>
              <description>[0:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x800500</resetValue>
        </register>
        <register>
          <name>FSM_FLES</name>
          <addressOffset>0x2280</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED12</name>
              <description>[31:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>BLK_TIOTP</name>
              <description>[11:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>BLK_OTP</name>
              <description>[7:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FSM_WR_ENA</name>
          <addressOffset>0x2288</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Internal. Only to be used through TI provided API.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>WR_ENA</name>
              <description>[2:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x2</resetValue>
        </register>
        <register>
          <name>FSM_ACC_PP</name>
          <addressOffset>0x228c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>FSM_ACC_PP</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
