btcven/cortex-debug-cc26xx-cc13xx/data/cc1310f32.svd
        <register>
          <name>SYNC</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Synch Register</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SYNC3</name>
              <description>[7:6] Synchronize GPT Timer 3.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOTH</name>
                  <value>3</value>
                  <description>A timeout event for both Timer A and Timer B of GPT3 is triggered</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMERB</name>
                  <value>2</value>
                  <description>A timeout event for Timer B of GPT3 is triggered</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMERA</name>
                  <value>1</value>
                  <description>A timeout event for Timer A of GPT3 is triggered</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOSYNC</name>
                  <value>0</value>
                  <description>No Sync. GPT3 is not affected.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNC2</name>
              <description>[5:4] Synchronize GPT Timer 2.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOTH</name>
                  <value>3</value>
                  <description>A timeout event for both Timer A and Timer B of GPT2 is triggered</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMERB</name>
                  <value>2</value>
                  <description>A timeout event for Timer B of GPT2 is triggered</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMERA</name>
                  <value>1</value>
                  <description>A timeout event for Timer A of GPT2 is triggered</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOSYNC</name>
                  <value>0</value>
                  <description>No Sync. GPT2 is not affected.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNC1</name>
              <description>[3:2] Synchronize GPT Timer 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOTH</name>
                  <value>3</value>
                  <description>A timeout event for both Timer A and Timer B of GPT1 is triggered</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMERB</name>
                  <value>2</value>
                  <description>A timeout event for Timer B of GPT1 is triggered</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMERA</name>
                  <value>1</value>
                  <description>A timeout event for Timer A of GPT1 is triggered</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOSYNC</name>
                  <value>0</value>
                  <description>No Sync. GPT1 is not affected.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNC0</name>
              <description>[1:0] Synchronize GPT Timer 0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOTH</name>
                  <value>3</value>
                  <description>A timeout event for both Timer A and Timer B of GPT0 is triggered</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMERB</name>
                  <value>2</value>
                  <description>A timeout event for Timer B of GPT0 is triggered</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMERA</name>
                  <value>1</value>
                  <description>A timeout event for Timer A of GPT0 is triggered</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOSYNC</name>
                  <value>0</value>
                  <description>No Sync. GPT0 is not affected.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IMR</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Interrupt Mask
This register is used to enable the interrupts.
Associated registers:
RIS, MIS, ICLR</description>
          <fields>
            <field>
              <name>RESERVED14</name>
              <description>[31:14] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>18</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>DMABIM</name>
              <description>[13:13] Enabling this bit will make the RIS.DMABRIS interrupt propagate to MIS.DMABMIS</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Enable Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Disable Interrupt</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>[12:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>TBMIM</name>
              <description>[11:11] Enabling this bit will make the RIS.TBMRIS interrupt propagate to MIS.TBMMIS</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Enable Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Disable Interrupt</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBEIM</name>
              <description>[10:10] Enabling this bit will make the RIS.CBERIS interrupt propagate to MIS.CBEMIS</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Enable Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Disable Interrupt</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBMIM</name>
              <description>[9:9] Enabling this bit will make the RIS.CBMRIS interrupt propagate to MIS.CBMMIS</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Enable Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Disable Interrupt</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBTOIM</name>
              <description>[8:8] Enabling this bit will make the RIS.TBTORIS interrupt propagate to MIS.TBTOMIS</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Enable Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Disable Interrupt</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>[7:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>DMAAIM</name>
              <description>[5:5] Enabling this bit will make the RIS.DMAARIS interrupt propagate to MIS.DMAAMIS</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Enable Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Disable Interrupt</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAMIM</name>
              <description>[4:4] Enabling this bit will make the RIS.TAMRIS interrupt propagate to MIS.TAMMIS</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Enable Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Disable Interrupt</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>[3:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CAEIM</name>
              <description>[2:2] Enabling this bit will make the RIS.CAERIS interrupt propagate to MIS.CAEMIS</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Enable Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Disable Interrupt</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAMIM</name>
              <description>[1:1] Enabling this bit will make the RIS.CAMRIS interrupt propagate to MIS.CAMMIS</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Enable Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Disable Interrupt</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TATOIM</name>
              <description>[0:0] Enabling this bit will make the RIS.TATORIS interrupt propagate to MIS.TATOMIS</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Enable Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Disable Interrupt</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RIS</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Raw Interrupt Status
Associated registers:
IMR, MIS, ICLR</description>
          <fields>
            <field>
              <name>RESERVED14</name>
              <description>[31:14] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>18</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>DMABRIS</name>
              <description>[13:13] GPT Timer B DMA Done Raw Interrupt Status

0: Transfer has not completed
1: Transfer has completed</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>[12:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>TBMRIS</name>
              <description>[11:11] GPT Timer B Match Raw  Interrupt

0:  The match value has not been reached
1:  The match value is reached.

TBMR.TBMIE is set, and the match values in TBMATCHR and optionally TBPMR have been reached when configured in one-shot or periodic mode.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>CBERIS</name>
              <description>[10:10] GPT Timer B Capture Mode Event Raw Interrupt

0:  The event has not occured.
1:  The event has occured.

