btcven/cortex-debug-cc26xx-cc13xx/data/cc1310f32.svd
Writing 1 to this bit clears SRIS.STOPRIS and SMIS.STOPMIS.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>STARTIC</name>
              <description>[1:1] Start condition interrupt clear

Writing 1 to this bit clears SRIS.STARTRIS SMIS.STARTMIS.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DATAIC</name>
              <description>[0:0] Data interrupt clear

Writing 1 to this bit clears SRIS.DATARIS SMIS.DATAMIS.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MSA</name>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <description>Master Salve Address
This register contains seven address bits of the slave to be accessed by the master (a6-a0), and an RS bit determining if the next operation is a receive or transmit.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SA</name>
              <description>[7:1] I2C master slave address
Defines which slave is addressed for the transaction in master mode</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RS</name>
              <description>[0:0] Receive or Send
This bit-field specifies if the next operation is a receive (high) or a transmit/send (low) from the addressed slave SA.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX</name>
                  <value>1</value>
                  <description>Receive data from slave</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX</name>
                  <value>0</value>
                  <description>Transmit/send data to slave</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MSTAT</name>
          <addressOffset>0x804</addressOffset>
          <size>32</size>
          <description>Master Status</description>
          <fields>
            <field>
              <name>RESERVED7</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>BUSBSY</name>
              <description>[6:6] Bus busy

0: The I2C bus is idle.
1: The I2C bus is busy.

The bit changes based on the MCTRL.START and MCTRL.STOP conditions.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>IDLE</name>
              <description>[5:5] I2C idle

0: The I2C controller is not idle.
1: The I2C controller is idle.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>ARBLST</name>
              <description>[4:4] Arbitration lost

0: The I2C controller won arbitration.
1: The I2C controller lost arbitration.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DATACK_N</name>
              <description>[3:3] Data Was Not Acknowledge

0: The transmitted data was acknowledged.
1: The transmitted data was not acknowledged.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>ADRACK_N</name>
              <description>[2:2] Address Was Not Acknowledge

0: The transmitted address was acknowledged.
1: The transmitted address was not acknowledged.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>ERR</name>
              <description>[1:1] Error

0: No error was detected on the last operation.
1: An error occurred on the last operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>BUSY</name>
              <description>[0:0] I2C busy

0: The controller is idle.
1: The controller is busy.

When this bit-field is set, the other status bits are not valid.

Note: The I2C controller requires four SYSBUS clock cycles to assert the BUSY status after I2C master operation has been initiated through MCTRL register. 
Hence after programming MCTRL register, application is requested to wait for four SYSBUS clock cycles before issuing a controller status inquiry through MSTAT register.
Any prior inquiry would result in wrong status being reported.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x20</resetValue>
        </register>
        <register>
          <name>MCTRL</name>
          <addressOffset>0x804</addressOffset>
          <size>32</size>
          <description>Master Control

This register accesses status bits when read and control bits when written. When read, the status register indicates the state of the I2C bus controller as stated in MSTAT. When written, the control register configures the I2C controller operation.

To generate a single transmit cycle, the I2C Master Slave Address (MSA) register is written with the desired address, the MSA.RS bit is cleared, and this register is written with 
* ACK=X (0 or 1), 
* STOP=1, 
* START=1, 
* RUN=1 
to perform the operation and stop. 
When the operation is completed (or aborted due an error), an interrupt becomes active and the data may be read from the MDR register.</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>ACK</name>
              <description>[3:3] Data acknowledge enable

