btcven/cortex-debug-cc26xx-cc13xx/data/cc1310f32.svd
        <register>
          <name>RFCMODEHWOPT</name>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <description>Allowed RFC Modes</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>AVAIL</name>
              <description>[7:0] Permitted RFC modes. More than one mode can be permitted.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE7</name>
                  <value>128</value>
                  <description>Mode 7 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE6</name>
                  <value>64</value>
                  <description>Mode 6 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE5</name>
                  <value>32</value>
                  <description>Mode 5 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE4</name>
                  <value>16</value>
                  <description>Mode 4 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE3</name>
                  <value>8</value>
                  <description>Mode 3 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE2</name>
                  <value>4</value>
                  <description>Mode 2 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <value>2</value>
                  <description>Mode 1 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE0</name>
                  <value>1</value>
                  <description>Mode 0 permitted</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PWRPROFSTAT</name>
          <addressOffset>0x1e0</addressOffset>
          <size>32</size>
          <description>Power Profiler Register</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[7:0] SW can use these bits to timestamp the application. These bits are also available through the testtap and can thus be used by the emulator to profile in real time.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>RAMRETEN</name>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <description>Memory Retention Control</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RFC</name>
              <description>[2:2] 0: Retention for RFC SRAM disabled
1: Retention for RFC SRAM enabled
    
Memories controlled: CPERAM  MCERAM  RFERAM</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>VIMS</name>
              <description>[1:0] 0: Memory retention disabled
1: Memory retention enabled

Bit 0: VIMS_TRAM
Bit 1: VIMS_CRAM

Legal modes depend on settings in VIMS:CTL.MODE

00: VIMS:CTL.MODE must be OFF before DEEPSLEEP is asserted - must be set to CACHE or SPLIT mode after waking up again
01: VIMS:CTL.MODE must be GPRAM before DEEPSLEEP is asserted. Must remain in GPRAM mode after wake up, alternatively select OFF mode first and then CACHE or SPILT mode.
10: Illegal mode
11: No restrictions</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x3</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RFC_DBELL</name>
      <baseAddress>0x40041000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <description>RF Core Doorbell</description>
      <registers>
        <register>
          <name>CMDR</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Doorbell Command Register</description>
          <fields>
            <field>
              <name>CMD</name>
              <description>[31:0] Command register. Raises an interrupt to the Command and packet engine (CPE) upon write.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CMDSTA</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Doorbell Command Status Register</description>
          <fields>
            <field>
              <name>STAT</name>
              <description>[31:0] Status of the last command used</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RFHWIFG</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Interrupt Flags From RF Hardware Modules</description>
          <fields>
            <field>
              <name>RESERVED20</name>
              <description>[31:20] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>RATCH7</name>
              <description>[19:19] Radio timer channel 7 interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>RATCH6</name>
              <description>[18:18] Radio timer channel 6 interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>RATCH5</name>
              <description>[17:17] Radio timer channel 5 interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>RATCH4</name>
              <description>[16:16] Radio timer channel 4 interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RATCH3</name>
              <description>[15:15] Radio timer channel 3 interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>RATCH2</name>
              <description>[14:14] Radio timer channel 2 interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>RATCH1</name>
              <description>[13:13] Radio timer channel 1 interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>RATCH0</name>
              <description>[12:12] Radio timer channel 0 interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>RFESOFT2</name>
              <description>[11:11] RF engine software defined interrupt 2 flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>RFESOFT1</name>
              <description>[10:10] RF engine software defined interrupt 1 flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>RFESOFT0</name>
              <description>[9:9] RF engine software defined interrupt 0 flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>RFEDONE</name>
              <description>[8:8] RF engine command done interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED7</name>
              <description>[7:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>TRCTK</name>
              <description>[6:6] Debug tracer system tick interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>MDMSOFT</name>
              <description>[5:5] Modem synchronization word detection interrupt flag. This interrupt will be raised by modem when the synchronization word is received. The CPE may decide to reject the packet based on its header (protocol specific). Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>MDMOUT</name>
              <description>[4:4] Modem FIFO output interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MDMIN</name>
              <description>[3:3] Modem FIFO input interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MDMDONE</name>
              <description>[2:2] Modem command done interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>FSCA</name>
              <description>[1:1] Frequency synthesizer calibration accelerator interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RFHWIEN</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Interrupt Enable For RF Hardware Modules</description>
          <fields>
            <field>
              <name>RESERVED20</name>
              <description>[31:20] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>RATCH7</name>
              <description>[19:19] Interrupt enable for RFHWIFG.RATCH7.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>RATCH6</name>
              <description>[18:18] Interrupt enable for RFHWIFG.RATCH6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>RATCH5</name>
              <description>[17:17] Interrupt enable for RFHWIFG.RATCH5.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>RATCH4</name>
              <description>[16:16] Interrupt enable for RFHWIFG.RATCH4.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RATCH3</name>
              <description>[15:15] Interrupt enable for RFHWIFG.RATCH3.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>RATCH2</name>
              <description>[14:14] Interrupt enable for RFHWIFG.RATCH2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>RATCH1</name>
              <description>[13:13] Interrupt enable for RFHWIFG.RATCH1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>RATCH0</name>
              <description>[12:12] Interrupt enable for RFHWIFG.RATCH0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>RFESOFT2</name>
              <description>[11:11] Interrupt enable for RFHWIFG.RFESOFT2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>RFESOFT1</name>
              <description>[10:10] Interrupt enable for RFHWIFG.RFESOFT1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>RFESOFT0</name>
              <description>[9:9] Interrupt enable for RFHWIFG.RFESOFT0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>RFEDONE</name>
              <description>[8:8] Interrupt enable for RFHWIFG.RFEDONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED7</name>
              <description>[7:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>TRCTK</name>
              <description>[6:6] Interrupt enable for RFHWIFG.TRCTK.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>MDMSOFT</name>
              <description>[5:5] Interrupt enable for RFHWIFG.MDMSOFT.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>MDMOUT</name>
              <description>[4:4] Interrupt enable for RFHWIFG.MDMOUT.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MDMIN</name>
              <description>[3:3] Interrupt enable for RFHWIFG.MDMIN.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MDMDONE</name>
              <description>[2:2] Interrupt enable for RFHWIFG.MDMDONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>FSCA</name>
              <description>[1:1] Interrupt enable for RFHWIFG.FSCA.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
